dictionary = {
    "ім'я": "Паша",
    "вік": 16,
    "контактна інформація": {
        "електронна пошта": "pavel@gmail.com",
        "номер телефону": "05066678476",
        "місто": "Луцьк",
        "поштовий індекс": "65000",
        "країна": "Україна"
    },
    "студент": False
}

# Словник з типами даних
types_dictionary = {
    "ім'я": str,
    "вік": int,
    "контактна інформація": {
        "електронна пошта": str,
        "номер телефону": str,
        "місто": str,
        "поштовий індекс": str,
        "країна": str
    },
    "студент": bool
}

print(dictionary)
print(types_dictionary)
print("найчастіший тип данних str")